
[{"TOTALCOUNT":"2","label":"Rapid Prototyping of Physical Objects","description":"This article talks about how recent technology advancements have dramatically reduced the cost of prototyping for physical objects, including large-scale machinery. Learn how to use the latest technologies to decrease time and resources used to build prototypes by a factor of more than 100.","link":"http://scn.sap.com/thread/3340436","serviceName":"Fast Company"},{"TOTALCOUNT":"2","label":"The New Dawn of Industrial Design","description":"Industrial Design is undergoing rapid changes due to the advent of new technologies, such as 3D printing. Industrial Designers and Engineers alike have to change their approach towards products and take advantage of the agility of product innovation.","link":"https://documents.wdf.sap.corp/share/page/site/CoEandRSDInfoSessionRollOut/document-details?nodeRef=workspace://SpacesStore/559f3491-db39-4477-a40d-7399f7352e4a","serviceName":"Vimeo"},
 {"TOTALCOUNT":"2","label":"50 Tips for working with Unity","description":"A guide to best practices for Unity development, using my experience with projects with small teams from 3 to 20 people.","link":"https://community.wdf.sap.corp/thread/106821","serviceName":"SAP Community"},
 {"TOTALCOUNT":"2","label":"The rise of the maker movement and what it means for the corporate world ","description":"The maker culture is a contemporary culture or subculture representing a technology-based extension of DIY culture. Typical interests enjoyed by the maker culture include engineering-oriented pursuits such as electronics, robotics, 3-D printing, and the use of CNC tools, as well as more traditional activities such as metalworking, woodworking, and traditional arts and crafts.","link":"https://community.wdf.sap.corp/docs/DOC-130701","serviceName":"SAP Community"},
 {"TOTALCOUNT":"2","label":"Sustainable materials in the enterprise","description":"A quick guide to how to keep a company sustainable as new technologies conquer the workplace, requiring new, more, or radically different materials. See how LevelX corp is using recycled plastic for their 3D prototypes.","link":"http://scn.sap.com/thread/3264423","serviceName":"Slideshare"},
 {"TOTALCOUNT":"2","label":"Just-in-time inventory for the 21st century","description":"As the 3D Revolution is taking hold, old models of Just-in-time are going to become obsolete. When you can print your inventory, you can potentially manufacture thousands of variations f a product completely on demand, at the push of a button. See how 3D Printing has already changed manufacturing in these 5 companies." ,"serviceName":"Business Insider"}]
