
[{"TOTALCOUNT":"2",
 "com.sap.ais.tax.core.uri":"learningcourse70F173F5CA7575CEE8CE7D856377201B40D6AC4A",
 "label":"3D Printing on Shapeways Using Maya",
 "description":"Show Details Hide Details 3D printing allows your digital creations to emerge in the real world, but you don t need a 3D printer to bring them to life. Learn how to prepare your models in Maya and then send them for 3D printing on Shapeways, an online service that ships reproductions straight to your door. Author Ryan Kittleson shows how to hollow out models, define an object s thickness, and work with texture maps for full-color prints. He shows you how to export the model, upload it to Shapeways, and view the finished result. Once you have mastered the basics, Ryan invites you to test your skills in a series of challenge videos. Topics include: What is Shapeways? Setting up Maya for 3D printing Checking model scale Understanding why thickness matters Adding precise thickness Strengthening thin structures Fixing common mesh problems Exporting models with texture maps Making a wireframe model Publishing to Shapeways",
 "link":"https://redhoop.com/lynda-3d-printing-on-shapeways-using-maya-8584-2.html",
 "com.sap.ais.tax.core.type":"learningcourse",
 "serviceName":"lynda.com"},
 {"TOTALCOUNT":"2",
 "com.sap.ais.tax.core.uri":"learningcourseE49D94273F3549B59E578EC21BE95C8C6F397634",
 "label":"QuickStart! - 3D Printing",
 "description":"3D printing is quickly becoming a new outlet for 3D enthusiasts everywhere to transform what used to be relegated to the monitor and screen into real, tangible assets. There are many methods for creating 3D prints of your models using a wide range of software; this VTC QuickStart! course will take you through one possible workflow. From sketching, to modeling in modo, to submitting a model to an online service provider, author Dwayne Ferguson will show you how to bring your models to life! This title is a self-paced software training course delivered via pre-recorded video. We do not provide additional information outside of the posted content. Work files for this course can be downloaded from the first lecture.",
 "link":"https://redhoop.com/udemy-quickstart-3d-printing-10009-2.html",
 "com.sap.ais.tax.core.type":"learningcourse",
 "serviceName":"udemy.com"},
 {"TOTALCOUNT":"1",
 "com.sap.ais.tax.core.uri":"content45395422F54E7252EF1E90E6AACEED51701BEFF2",
 "label":"Nokia supports 3D Printing of Phone Covers",
 "description":"Nokia releases 3D templates, case specs, recommended materials and best practices for end users to print their own phone covers.",
 "link":"https://community.wdf.sap.corp/groups/digital-manufacturing/blog/2013/01/24/nokia-supports-3d-printing-of-phone-covers",
 "com.sap.ais.tax.core.type":"content",
 "serviceName":"SAP Community"},
{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content45395422F54E7252EF1E90E6AACEED51701BEFF2",
 "label":"Getting Started with MakerBot 3D Printers",
 "description":"MakerBot 3D printers are some of the most popular and affordable printers around. Kacie Hultgren also shows you how useful they can be. Dive in and learn how to get the most from your MakerBot, set it up correctly, and prepare a basic 3D model for print. Explore when and why to use custom settings like rafts and support material, and learn to troubleshoot problems so you can keep your MakerBot running smoothly.",
 "link":"http://www.lynda.com/CAD-Prototyping-tutorials/Getting-Started-MakerBot-3D-Printers/156544-2.html","com.sap.ais.tax.core.type":"content","serviceName":"Lynda.com"},
    {"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content45395422F54E7252EF1E90E6AACEED51701BEFF2",
 "label":"A Comprehensive Introduction to 3D Printing Technology",
 "description":"The topic of 3D printing has peaked your interest? Have you tried to find information on this vast subject, but got lost either in a multitude of 3D printing news only sites, or short and/or superficial articles? Are you still trying to get your head around the ins and outs of 3D printing technology? If you answered yes to any of the above questions, you are not alone! 3D printing can be complex to take in initially, as the learning curve may be quite steep. We know the feeling since we have been there ourselves. But, do not despair, we have written this article to explain 3D printing technology with the beginner in mind. To make all of this easy to understand, we have added quite a few pictures and illustrations. Hope you enjoy the read!.",
 "link":"http://3dprintingforbeginners.com/3d-printing-technology/",
 "com.sap.ais.tax.core.type":"content","serviceName":"3DPrintingForBeginners.com"},
        {"TOTALCOUNT":"1",
 "com.sap.ais.tax.core.uri":"content45395422F54E7252EF1E90E6AACEED51701BEFF2",
 "label":"How 3D Printing works",
 "description":"Additive manufacturing (AM) is the family of manufacturing technology that includes 3-D printing. AM is the means of creating an object by adding material to the object layer by layer. AM is the current terminology established by ASTM International (formerly the American Society for Testing and Materials) [source: Gibson, et al.]. Throughout its history, additive manufacturing in general has gone by various names:stereolithography, 3-D layering and 3-D printing. This article uses 3-D printing because it seems to be the most common term used to describe AM products.",
 "link":"http://computer.howstuffworks.com/3-d-printing.htm","com.sap.ais.tax.core.type":"content","serviceName":"howstuffworks.com"}]
