[{"label":"Lean Startup in practice (video)","description":"Hi,  on the Karlsruher Entwicklertag, there was a presentation on the \"lean startup march\" (thanks to Jochen G&uuml;rtler for sharing the link): http://www.youtube.com/watch?v=EeSJsuhe1f0&amp;feature=youtu.be (if you want to see the slides in parallel,","link":"https://community.wdf.sap.corp/thread/95926","serviceName":"SAP Community"},{"label":"Freeing Digital Creativity: messing up, saying yes, being agile... and all the sides to a Brand s story","description":"The latest Google s Think Quarterly is out and, as usual, is fun and insightful.   It covers several interesting subjects, from how messing up is part of the process to quoting The Lean Startup by Eric Ries, a book that is wildly popular right now in the","link":"https://community.wdf.sap.corp/community/marketing/blog/2012/04/03/freeing-digital-creativity-messing-up-saying-yes-being-agile-and-all-the-sides-to-a-brands-story","serviceName":"SAP Community"},{"label":"LACT IL bookshelf","description":"Lean Books&nbsp;  BookTitleCopies Leading Lean Software Development  Mary Poppendieck, Tom Poppendieck 1 Toyota Kata: Managing People for Improvement, Adaptiveness and Superior Results  Mike Rother 1The Lean Startup: How Today s Entrepreneurs Use","link":"https://community.wdf.sap.corp/docs/DOC-132266","serviceName":"SAP Community"},{"label":"Whitepaper and presentation on Lean Design Thinking","description":"Hi all, &nbsp;  I wanted to make you aware of an interesting work on comparing and combining Lean Startup and Design Thinking. We ve been looking into both methodologies for our team and I see quite some value in the combination.  Design &amp;","link":"https://community.wdf.sap.corp/groups/design-thinking/blog/2013/06/14/whitepaper-and-presentation-on-lean-design-thinking","serviceName":"SAP Community"},{"label":"The Lean Startup: How Today s Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses by Eric Ries","description":"BookContent  &nbsp; &nbsp;  Links:  Google BooksAmazonbooks24x7 (Audio Book)\"Most startups fail. But many of those failures are preventable.&nbsp; The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and","link":"https://community.wdf.sap.corp/docs/DOC-221083","serviceName":"SAP Community"}]
