
[{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"learningcourse70F173F5CA7575CEE8CE7D856377201B40D6AC4A","label":"3D Printing on Shapeways Using Maya","description":"Show Details Hide Details 3D printing allows your digital creations to emerge in the real world, but you don t need a 3D printer to bring them to life. Learn how to prepare your models in Maya and then send them for 3D printing on Shapeways, an online service that ships reproductions straight to your door. Author Ryan Kittleson shows how to hollow out models, define an object s thickness, and work with texture maps for full-color prints. He shows you how to export the model, upload it to Shapeways, and view the finished result. Once you have mastered the basics, Ryan invites you to test your skills in a series of challenge videos. Topics include: What is Shapeways? Setting up Maya for 3D printing Checking model scale Understanding why thickness matters Adding precise thickness Strengthening thin structures Fixing common mesh problems Exporting models with texture maps Making a wireframe model Publishing to Shapeways","link":"https://redhoop.com/lynda-3d-printing-on-shapeways-using-maya-8584-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"lynda.com"},{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"learningcourseE49D94273F3549B59E578EC21BE95C8C6F397634","label":"QuickStart! - 3D Printing","description":"3D printing is quickly becoming a new outlet for 3D enthusiasts everywhere to transform what used to be relegated to the monitor and screen into real, tangible assets. There are many methods for creating 3D prints of your models using a wide range of software; this VTC QuickStart! course will take you through one possible workflow. From sketching, to modeling in modo, to submitting a model to an online service provider, author Dwayne Ferguson will show you how to bring your models to life! This title is a self-paced software training course delivered via pre-recorded video. We do not provide additional information outside of the posted content. Work files for this course can be downloaded from the first lecture.","link":"https://redhoop.com/udemy-quickstart-3d-printing-10009-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content45395422F54E7252EF1E90E6AACEED51701BEFF2","label":"Nokia supports 3D Printing of Phone Covers","description":"Nokia releases 3D templates, case specs, recommended materials and best practices for end users to print their own phone covers. &nbsp;  http://conversations.nokia.com/2013/01/18/everything-you-need-to-know-about-the-lumia-820-and-3d-printing/","link":"https://community.wdf.sap.corp/groups/digital-manufacturing/blog/2013/01/24/nokia-supports-3d-printing-of-phone-covers","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"}]