
[{"TOTALCOUNT":"3","com.sap.ais.tax.core.uri":"learningcourse133C39EC07AFC8F3FC14AC613B4F69A98CE16605","label":"Customer Service Training","description":"Show Details Hide Details This Customer Service training course teaches the basics of customer service and translates that knowledge into practical application. Students will come away from this customer service course knowing how a positive attitude, going a step beyond basic customer service, and dealing effectively with complaints will enhance their work experience. Students will learn the difference between internal and external customers and will learn how the development and implementation of a comprehensive customer service policy promotes consistency in how customers are treated and keeps customers happy. Customer Service Training Course Goals Understand customer service. Identify internal and external customers. Learn how to interact positively with customers. Develop a positive attitude. Learn to communicate effectively. Learn to create and implement service standards. Learn to evaluate and monitor service standards. Learn to create memorable customer service.","link":"https://redhoop.com/udemy-customer-service-training-830-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"content65A1AD1379D8DB179E2D1AC7F47B916A2BACDE49","label":"Fundamentals of Exceptional Customer Service","description":"Type: E-Learning  Cost: Free  Link: https://learningportal.wdf.sap.corp/sap/bc/bsp/sap/z_lso_center/trainingtype.htm?plvar=01&amp;otype=D&amp;objid=70030603 &nbsp;  Description:You ve seen the ad campaigns that boast, \"Customer satisfaction guaranteed.\"","link":"https://community.wdf.sap.corp/docs/DOC-51391","com.sap.ais.tax.core.type":"content","serviceName":"SAP Community"},{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"learningcourseF27828973B237448DADCFE198F12DA6B02972B01","label":"CRM, DELIVER EXCELLENT CUSTOMER SERVICE","description":"This is an in-role and break-down recording of a CRM demo scenario that was showcased by Ruben Cid at SAPPHIRE NOW Madrid 2011. Watch and hear how this material was presented to customers on the show floor. After completing this course, you will be able to understand how to deliver the intro, summar","link":"https://learningportal.wdf.sap.corp/sap/bc/bsp/sap/z_lso_center/trainingtype.htm?plvar=01&otype=D&objid=70172614","com.sap.ais.tax.core.type":"learningcourse"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content67A75AE9BB587B32505CC736B53B6C5E065B845E","label":"Get insights how HTC provides superior customer service through multiple channels including Social Media","description":"You want to learn more about how HTC provides superior customer service with a customized customer experience through multi channels incl. Social Media? &#160;  Then you need to join the following sessions provided by&#160; Elizabeth Griffin -","link":"http://scn.sap.com/community/high-tech/blog/2013/05/10/get-insights-how-htc-provides-superior-customer-service-through-multiple-channels-including-social-media","com.sap.ais.tax.core.type":"content","serviceName":"SAP SCN"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"learningcourseA5B386BB016680A5245691D1AD450C5AA6CBCD99","label":"CROSS-SELLING IN A CUSTOMER SERVICE CALL","description":"If there s one advantage most companies have learned to appreciate in recent years, it s \"flexibility\". Technology, the economy, and global events have forced companies to cope with a host of new challenges by being flexible. Flexibility is a key factor in customer call centers. As a customer servic","link":"https://learningportal.wdf.sap.corp/sap/bc/bsp/sap/z_lso_center/trainingtype.htm?plvar=01&otype=D&objid=70086812","com.sap.ais.tax.core.type":"learningcourse"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"learningcourse7B499C17147427183B6E4D0F0D61C54B22BC4671","label":"MULTICHANNEL CUSTOMER SERVICE","description":"This course will cover the Multichannel Customer Service E2E Solution offering. The course will help you learn the SAP products that you can sell as part of this end to end solution. Along with discussing the SAP products, the course will cover how you can message and sell the solution to your custo","link":"https://learningportal.wdf.sap.corp/sap/bc/bsp/sap/z_lso_center/trainingtype.htm?plvar=01&otype=D&objid=70220980","com.sap.ais.tax.core.type":"learningcourse"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"learningcourse9785C1A37FACC0EBA375EDD9743DFC76B7D290F0","label":"CALL CENTER CUSTOMER SERVICE","description":"Have you just become a call center customer service representative? Maybe you are experiencing some feelings of anxiety, as do many novice agents. You may be concerned about dealing with customers  issues one- on-one. Fortunately, there is a comprehensive training course for people in your situation","link":"https://learningportal.wdf.sap.corp/sap/bc/bsp/sap/z_lso_center/trainingtype.htm?plvar=01&otype=D&objid=70086807","com.sap.ais.tax.core.type":"learningcourse"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentB309213724319B812199F82C08C31712D8465A68","label":"What are the credentials of the customer service and technical support personnel fielding the questions?","description":"Support personal are specifically trained and organized to be able to provide increasingly sophisticated expertise that matches the level of severity on an individual issue. From the highly skilled support resources that address issues right from the initial  report to the highly specialized resourc","link":"https://paq.wdf.sap.corp/Default.aspx?RecordNo=390398&ref=cSearch","com.sap.ais.tax.core.type":"content","serviceName":"SAP Community"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"learningcourse17FBA876E9E13572C16333CE493C175A235A9EC9","label":"Integrating Social Media with F2F Customer Service","description":"Discover How To Harness The Power of Social Media Sites To Ignite Your Business... In this day and age when customer have too many choice and not enough time, it is important to deliver a remarkable experience.  These remarkable (or even less than remarkable) experience are often capture, recounted and shared online via social media.   This course explores how brick and mortar, local businesses, can first create positive, remarkable customer experiences and then integrate those efforts with a solid social media presence thereby increasing foot traffic back to their stores. This course consists of 5 modules with nearly 1.5 hours of videos plus worksheet and checklists to get your started.","link":"https://redhoop.com/udemy-integrating-social-media-with-f2f-customer-service-5069-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentE0E0BF6183A4FDD85B923FC90A5755B5B0CD6F82","label":"Highlights: SAP Customer OnDemand Support Portal: Deliver exceptional customer service","description":"\"Introducing SAP Cloud Support Site -- an interaction channel which gives your customers cost-effective, 24/7 self-service. Using SAP Cloud Support Site, your customers can view and create tickets, access a knowledge base, and interact with your agents all via a company-branded website, allowing you","link":"https://mediashare.wdf.sap.corp/public/id/0_w9bwjmrq","com.sap.ais.tax.core.type":"content","serviceName":"SAP Mediashare"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content95AAD35F3327255F8C74C21A259334551DC57993","label":"Webcast: Improve customer service and support with collaboration - Sept. 24","description":"Successful organizations have adopted a series of best practices for social collaboration, according to Ray Wang and his team at Constellation Research. In their 2013 survey of over 200 social business adopters, they found that a majority of market","link":"http://scn.sap.com/community/socialsoftware/blog/2013/09/23/webcast-improve-customer-service-and-support-with-collaboration--sept-24","com.sap.ais.tax.core.type":"content","serviceName":"SAP SCN"}]
