
[{"TOTALCOUNT":"3","label":"If you are preparing for PMP certification exam","description":"for anyone who prepare for PMP exam you should visit this site www.pmvirt.com it contains a great free exams and other resources.","link":"http://scn.sap.com/thread/2010617","serviceName":"SAP SCN"},{"TOTALCOUNT":"3","label":"Is it possible to register for SAP certification exam in PP in Kuwai?","description":"Hi, &#160;  I want to register for SAP PP certification examination in Kuwait. &#160;  Please let me know who offers the certification exams in Kuwait.  &#160;  Also please let me know if there is any e-academy in Kuwait and if so , who offers it? &#160;","link":"http://scn.sap.com/thread/1587274","serviceName":"SAP SCN"},{"TOTALCOUNT":"3","label":"Message from SAP Education re: SAP BusinessObjects certification exams","description":"Effective April, 2010, there will be new SAP BusinessObjects certification exams available after realignment with the SAP certification program.&#160; All existing SAP BusinessObjects exams will be retired at the end of April and will be replaced by the","link":"http://scn.sap.com/thread/1599245","serviceName":"SAP SCN"},{"TOTALCOUNT":"3","label":"Requesting feedback:  Job Task Analysis Survey","description":"The Certification and Enablement Council has recommended that the SAP Certification program can be enhanced by requesting input from the customer community related to the Job Task Analysis process and design of certification exams. &nbsp;  It is crucial","link":"https://community.wdf.sap.corp/docs/DOC-175594","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"Lyla Ponce_29.10.2012_ILP&Certification.xlsx","description":"Lyla Ponce_29.10.2012_ILP&Certification.xlsx","link":"https://community.wdf.sap.corp/docs/DOC-172706","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"Certificate for SAP Certification","description":"I appeard for SAP FI certification on Dec 30, 2010 in Bangalore and passed it. I ve not received any certificate from SAP yet. I have sent 7-8 emails to the local contact over last week and not even a single one has been responded. Not sure whom to","link":"http://scn.sap.com/thread/2132289","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"ILM certification","description":"Hello experts, &#160;  Is there any SAP certification program available for&#160; SAP ILM / Archiving ? &#160;  Thanks in Advance.","link":"http://scn.sap.com/thread/2033875","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"Oracle 11g PL/SQL Fundamentals 1","description":"The primary objective of this Oracle 11g training course is to provide an introduction to the PL/SQL database programming language covering syntax, structure and features of the language within the context of database applications and programming.This Oracle 11g course will prepare students for the Oracle certification exams (OCP).","link":"https://redhoop.com/udemy-oracle-11g-plsql-fundamentals-1-4126-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"C5163375 011 Template ILP&Certification Adriana Lopez.xlsx","description":"C5163375 011 Template ILP&Certification Adriana Lopez.xlsx","link":"https://community.wdf.sap.corp/docs/DOC-102405","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"SAP Certification exams","description":"Hi I am preparing for C-A1LOG-7 exam. I need your positive suggestions as if I go for shoptraining.com&#160; then how will it be helpful to secure good grades?","link":"http://scn.sap.com/thread/2066979","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"Project Management Professional (PMP)®","description":"Show Details Hide Details Get your project management skills certified - Avail limited period offer on PMP exam prep course at $99 Project Management Professional (PMP)® is one of the most demanded professional certification in project management. PMP certification is offered by the reputed PMI Institute to candidates who qualify in the rigorous PMP exam. Candidates need to fulfill PMI eligibility criteria of educational qualification and professional experience before attempting the PMP exam. PMP exam is of 4 hours duration that includes 200 multiple-choice questions. PMP certification exam is based on PMBOK Guide, popularly referred as the Bible of Project Management. Simplilearn is a PMI approved global registered education provider; our REP ID is 3147. We provide PMP certification training through classroom sessions, online training, virtual training coupled with practice tests. Simplilearn’s PMP courseware is based on PMBOK Guide fifth edition. Each chapter is followed by quizzes ","link":"https://redhoop.com/udemy-project-management-professional-pmp-8280-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"SAP BO certification completed but didn t recieved the certificate yet","description":"Hi SAP Education Team, &#160;  This is kiran kumar Patnaik.I completed my SAP certification for the papers  201,301,401 and XIR3.0 upgrade. &#160;  I got the marksheet immediatly after the exam but didn t recieve the certificate.  I changed my company","link":"http://scn.sap.com/thread/3165377","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"SAP SD - Newly Joined","description":"Hi  Recently I have joined as an SAP SD consultant after my SAP certification from SIEMENS. Iam currently on a support project and I have access to Dev server. I have an apprehension that the knowledge which I gathered in certification is too basic stuff","link":"http://scn.sap.com/thread/3218790","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"34% Increase in Partner Certification in the First Quarter!","description":"2012 has got off to an excellent start for SAP Certification program as the excellent collaboration with both the Ecosystems &amp; Channels organization and the Certification &amp; Enablement Influence Council drove a 34% increase in partner","link":"https://community.wdf.sap.corp/community/sap_education/blog/2012/05/10/34-increase-in-partner-certification-in-the-first-quarter","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"34% Increase in Partner Certification in the First Quarter!","description":"2012 has got off to an excellent start for SAP Certification program as the excellent collaboration with both the Ecosystems &amp; Channels organization and the Certification &amp; Enablement Influence Council drove a 34% increase in partner","link":"https://community.wdf.sap.corp/community/ecinteractive/blog/2012/05/15/34-increase-in-partner-certification-in-the-first-quarter","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"Study material for Project system","description":"Hi all,&#160; I want to appear for Certification in SAP Project system externally&#160; can any body guide on how can we directly appear for exams, what is the procedure?, what are the eligibility? etc&#160; and also i would be thankful if you can send","link":"http://scn.sap.com/thread/3286145","serviceName":"SAP SCN"},{"TOTALCOUNT":"2","label":"PowerPoint 2013: Office Certification Series","description":"Show Details Hide Details This course is the first in a series that covers the new Microsoft Office Specialist exam format for 2013. The new exams are completely different! PowerPoint 2013: Office Certification Series covers the PowerPoint 2013 Microsoft Office Specialist Exam #77-422 exam from Microsoft. By passing this exam and earning a Microsoft certification you become part of the MCP (Microsoft Certified Professional) network which will enhance job opportunities and could increase pay as well. With the course you will receive practice materials and the skills needed to pass the PowerPoint 2013 exam. This course should take you only a few days to complete.There are 6 sections in this course, and each lecture is tied directly to one or more skill measures as defined by Microsoft. This course covers every objective listed by Microsoft and a few skills that are not, but are considered valuable knowledge. Mail merge for example is not covered on the exam, but is a huge time saver when","link":"https://redhoop.com/udemy-powerpoint-2013-office-certification-series-7619-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"Professional Risk Manager (PRM) Certification: Level 2","description":"Show Details Hide Details Why Professional Risk Manager? If you are looking for a lucrative finance career in Risk Consultancy Firms, Banks, Insurance companies, Asset Management, Hedge funds, Investment banks etc., then PRM (Professional Risk Manager) is the right catch for you. PRM is a professional designation awarded by the PRMIA to Professional Risk Managers (PRM) who passes their four online exams. PRM-II Curriculum focuses on providing knowledge and understanding of Mathematical Foundation of Risks: Descriptive Statistics & Calculus Linear Mathematics & Matrix Algebra Probability Theory, Regression Analysis & Numerical Methods Professional Recognition & Job Satisfaction A PRM Charter can improve job opportunities, professional reputation & pay.  Types of Businesses that hire PRMs include: Risk Consultancy Firms, Banks, Insurance Companies, Asset Management, Hedge Funds, Investment Banks etc. How to update your CV with Professional Risk Management Skills? After qualifying Profess","link":"https://redhoop.com/udemy-professional-risk-manager-prm-certification-level-2-7599-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"Microsoft Windows Server 2012 Certification - Exam 70-412","description":"Show Details Hide Details Being MCSA certified is without a doubt a very prestigious accolade and will increase your earning potential. Training for Microsoft Certification used to be expensive, but Infinite Skills have now teamed up with Udemy to offer the complete MCSA study course for a fraction of the traditional cost. This course is part 3 of a 3 part series that will prepare you for the MCSA Certification. The other courses required to become MCSA are 70-410 70-411 </p> This Microsoft Windows Server 2012 training course for Configuring Advanced Windows Server 2012 Services (70-412) from Infinite Skills covers the advanced Windows Server topics you will need in order to pass your exam. This tutorial builds on the 70-410 and 70-411 exam training, and is the third in the series you will need for your MCSA (Microsoft Certified Solutions Associate) certification. This video training is designed for IT professionals who have already passed their 70-410 and 70-411 exams, or have a solid","link":"https://redhoop.com/udemy-microsoft-windows-server-2012-certification-exam-70-412-8077-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"Professional Risk Manager (PRM) Certification: Level 3","description":"Show Details Hide Details Why Professional Risk Manager? If you are looking for a lucrative finance career in Risk Consultancy Firms, Banks, Insurance companies, Asset Management, Hedge funds, Investment banks etc., then PRM (Professional Risk Manager) is the right catch for you. PRM is a professional designation awarded by the PRMIA to Professional Risk Managers (PRM) who passes their four online exams. PRM-III Curriculum focuses on providing knowledge and understanding of: Modern Risk Management Practices: Capital Allocation & RAPM Market Risk: Advanced VAR, Stress & Scenario Testing, Liquidity Risk Management etc. Credit Risk: Credit Exposure & Migration, Portfolio Models of Credit Loss, Credit Risk Capital Calculation etc. Operational Risk: Risk Frameworks, Risk Process Models, VAR, Enterprise Information Risk, Systematic Risk etc. Professional Recognition & Job Satisfaction A PRM Charter can improve job opportunities, professional reputation & pay.  Types of Businesses that hire P","link":"https://redhoop.com/udemy-professional-risk-manager-prm-certification-level-3-7598-2.html","serviceName":"udemy.com"}]
