
[{"TOTALCOUNT":"5","label":"SQL on Hadoop - Analyzing Big Data with Hive","description":"From developer to analyst, this course tackles a few big questions about big data: Why does this technology exist and why do I need it? How can I get the best out of it utilizing something familiar like SQL and how does this all fit together in an ever-evolving eco-system? This course will introduce the concepts of distributed computing, Hadoop and MapReduce and then goes into great detail into Apache Hive which is an SQL-like query language that can be used with Hadoop and NoSQL databases like HBase and Cassandra. The course presents some challenges you might experience solving real production problems and how Hive makes that task easier to accomplish.","link":"https://redhoop.com/pluralsight-sql-on-hadoop-analyzing-big-data-with-hive-9498-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"3","label":"Building NoSQL Apps With Redis","description":"Show Details Hide Details Redis is an extremely fast NoSQL database. It is widely used by many large web applications like Twitter and Stackoverflow. However, getting started with Redis can be intimidating. A lot of developers find Redis is very different than relational databases like SQL Server or Oracle and even quite different than other NoSQL databases like MongoDB or RavenDB. In this course, you will begin to understand exactly what Redis is and how Redis works. You will walk through 5 data structures of Redis that will help you to understand how each data structure works and when you might use it. John will show you how to install Redis, both on a Windows machine for learning and testing and on a real Linux server for production use. You ll also learn about the ServiceStack.Redis C# client for accessing Redis from C# code. Finally, John will take you through the process of creating a real application with Redis and ASP.NET MVC4 as we put what we learned into practice. The purpos","link":"https://redhoop.com/pluralsight-building-nosql-apps-with-redis-6990-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"3","label":"SQL Big Data Convergence - The Big Picture","description":"This course explains what Big Data, Hadoop and Massively Parallel Processing (MPP) data warehouse technologies are, and how the latter two are converging technologically. Products from Hadapt, Teradata, ParAccel, Microsoft and Cloudera -- all of which integrate with Apache Hadoop -- are investigated","link":"https://redhoop.com/pluralsight-sql-big-data-convergence-the-big-picture-6992-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"3","label":"Web Intelligence and Big Data","description":"The past decade has witnessed the successful of application of many AI techniques used at `web-scale’, on what are popularly referred to as big data platforms based on the map-reduce parallel computing paradigm and associated technologies such as distributed file systems, no-SQL databases and stream computing engines. Online advertising, machine translation, natural language understanding, sentiment mining, personalized medicine, and national security are some examples of such AI-based web-intelligence applications that are already in the public eye. Others, though less apparent, impact the operations of large enterprises from sales and marketing to manufacturing and supply chains. In this course we explore some such applications, the AI/statistical techniques that make them possible, along with parallel implementations using map-reduce and related platforms.","link":"https://redhoop.com/coursera-web-intelligence-and-big-data-3892-2.html","serviceName":"coursera.org"},{"TOTALCOUNT":"3","label":"Up and Running with NoSQL Databases","description":"Show Details Hide Details Explore the possibilities NoSQL databases offer developers for unparalleled flexibility and performance. In this course, author Joseph LeBlanc shows how to build an entire web application with CouchDB and introduces techniques such as querying with JavaScript, working with nested data, and creating views. He also explains some of the trade-offs you might encounter with NoSQL databases, such as the complexity of partitioning data across multiple servers, and presents five commonly used NoSQL databases: CouchDB, MongoDB, Cassandra, Riak, and Redis. Topics include: What is NoSQL? Installing CouchDB on Mac, Windows, and Linux Storing data Nesting document data Specifying search criteria Reducing data Attaching and retrieving images Deploying applications Securing CouchDB Understanding the CAP theorem","link":"https://redhoop.com/lynda-up-and-running-with-nosql-databases-2177-2.html","serviceName":"lynda.com"},{"TOTALCOUNT":"3","label":"SAP and Hadoop","description":"In today&#8217;s enterprise, Apache Hadoop has found a place alongside established databases and data warehouses. SAP HANA uniformly amplifies the value of Big Data across this data fabric including large data sets that are stored in Hadoop. Take","link":"https://community.wdf.sap.corp/docs/DOC-197678","serviceName":"SAP Community"},{"TOTALCOUNT":"3","label":"Introduction to Raven DB","description":"Raven DB is a document database that is part of the NoSQL movement of databases that don t use relational models and SQL. In this course you will learn how Raven DB works and how to use Raven DB in a .NET application. This is an introductory level course, but we will dive deep into Raven itself to get a good understanding of how this document database stores and retrieves your data.","link":"https://redhoop.com/pluralsight-introduction-to-raven-db-6986-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"3","label":"Big Data Conference in Berlin","description":"Here s a news item that may appeal to Big Data fans in Germany. Berlin Buzzwords 2012 \"is a conference for developers and users of open source software projects, focussing on the issues of scalable search, data-analysis in the cloud and NoSQL-databases.\"","link":"https://community.wdf.sap.corp/community/hadoop/blog/2012/01/18/big-data-conference-in-berlin","serviceName":"SAP Community"},{"TOTALCOUNT":"3","label":"How Can Hadoop Complement Hana? (Part 1)","description":"DISCLAIMER: This is not yet another \"SQL/HANA\"&nbsp; versus \"NoSQL/Hadoop\" technical debate. This is the first part of a series of blogs whith a goal to engage the development community at SAP into discussion about figuring out what are the other","link":"https://community.wdf.sap.corp/community/hadoop/blog/2011/07/28/how-nosqlhadoop-complements-sqlhana-part-1","serviceName":"SAP Community"},{"TOTALCOUNT":"3","label":"Learning MongoDB","description":"NoSQL databases have received a lot of attention in the last few years, and MongoDB is currently the most popular one. If you’ve been looking at MongoDB for a while now, but aren’t ready to take the plunge away from good old MySQL, this course should be exactly what you need to get started with the wonderful world of NoSQL databases. 20 LessonsView Course","link":"https://redhoop.com/tuts-learning-mongodb-5882-2.html","serviceName":"tutsplus.com"},{"TOTALCOUNT":"2","label":"Introduction to Data Science","description":"Commerce and research is being transformed by data-driven discovery and prediction. Skills required for data analytics at massive levels – scalable data management on and off the cloud, parallel algorithms, statistical modeling, and proficiency with a complex ecosystem of tools and platforms – span a variety of disciplines and are not easy to obtain through conventional curricula. Tour the basic techniques of data science, including both SQL and NoSQL solutions for massive data management (e.g., MapReduce and contemporaries), algorithms for data mining (e.g., clustering and association rule mining), and basic statistical modeling (e.g., linear and non-linear regression).","link":"https://redhoop.com/coursera-introduction-to-data-science-3751-2.html","serviceName":"coursera.org"},{"TOTALCOUNT":"2","label":"Schema Analyzer for MongoDB","description":"Schema Analyzer for MongoDB - In the lines of DESC TABLE in SQL: https://github.com/jamescropcho/variety","link":"https://community.wdf.sap.corp/thread/96766","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"Big Data: The Big Picture","description":"In this course, ZDNet’s Big Data correspondent Andrew Brust teaches you all about Big Data. This course will get you up and running with the definitions and technologies you need to know, and the vendors you need to know about. By the end of the course, you’ll know what Big Data is, how it can integrate with conventional database and Business Intelligence (BI) technologies, and how to devise a strategy for adopting Big Data in your organization. No Big Data or NoSQL knowledge is required, but a lot will be imparted. This course is aimed at executives and business decision makers, and is actionable for technologists as well.","link":"https://redhoop.com/pluralsight-big-data-the-big-picture-6989-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"2","label":"Big Data Market Survey: Hadoop Solutions (By Edd Dumbill, O Reilly Radar)","description":"In his Jan 22, 2012 blog post titled \"Big Data Market Survey: Hadoop Solutions\" Edd Dumbill provides a nice overview of Hadoop market spaces.  &nbsp;  In the survey, Edd makes the assumption that a data warehousing solution alone is not the answer to Big","link":"https://community.wdf.sap.corp/community/hadoop/blog/2012/03/01/big-data-market-survey-hadoop-solutions-by-edd-dumbill-oreilly-radar","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"Apache Hadoop spurs hopes but creates hardships for analytics users","description":"Comments:   1) excellent HANA mention toward the end of the article   2) the article correctly points out that Hadoop is just one part of a complete approach to big data &nbsp; &nbsp; &nbsp;  from SearchBusinessAnalytics - URL for article:","link":"https://community.wdf.sap.corp/docs/DOC-171429","serviceName":"SAP Community"},{"TOTALCOUNT":"2","label":"SQL Essentials","description":"In this course, Andrew Burgess will teach you the essentials of querying databases, using SQL. Don’t worry; it shouldn’t be too hard! 21 LessonsView Course","link":"https://redhoop.com/tuts-sql-essentials-5905-2.html","serviceName":"tutsplus.com"},{"TOTALCOUNT":"2","label":"SQL Server: Transact-SQL Basic Data Retrieval","description":"If you need to retrieve data from a SQL Server database then you need to know how to use the SELECT statement. This course starts with the basics of a SELECT statement and its various sub-clauses, and progresses to how to select from multiple data sources in the same statement and a comprehensive section on the functions available to manipulate, aggregate, and convert data during the select operation. More then fifty demos help to give you a thorough understanding of how to perform these essential operations, all using a freely-available demo environment that you re shown how to set up and configure. This course is perfect for developers who need to query SQL Server databases to retrieve data, from complete beginners through to more experienced developers who can use some of the modules as reference material. The information in the course applies to all versions from SQL Server 2005 onwards.","link":"https://redhoop.com/pluralsight-sql-server-transact-sql-basic-data-retrieval-7160-2.html","serviceName":"pluralsight.com"},{"TOTALCOUNT":"2","label":"Practical SQL Skills from Beginner to Intermediate","description":"Show Details Hide Details This course is designed to give a detailed introduction to using and understanding structured query language (SQL) for manipulating business data. More and more companies rely on IT systems that store information in databases. This information is typically retrieved using SQL and its use is becoming widespread amongst not just IT teams but business users also. The course contains walk through videos, printed documents of the course material as well as links to resources you need to be able to carry out the course. The course is laid out over 3 levels starting with the very basics and assumes no prior SQL knowledge, right up to level 3 where we will be looking at Microsoft SQL Server specific functionality to really harness the power of a SQL database. If you need to access any data be it online or within your own company then this course is for you. Financial systems form the hub of any business these days and many job roles require some level of SQL ability. ","link":"https://redhoop.com/udemy-practical-sql-skills-from-beginner-to-intermediate-4954-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"C# 2012 Fundamentals Part II","description":"Show Details Hide Details C# 2012 Fundamentals LiveLessons presents Paul Deitel s signature \"Live Code\" treatment of Microsoft s C# 2012 programming language. Every important C# concept is presented in the context of a complete, working C# 2012 program. This four-part LiveLesson contains over 20,000 lines of fully tested C# program code. And developers are free to reuse all of it. Among the key topics included in this LiveLesson are:  • Windows 8 UI: Windows 8 UI style apps are called Windows Store apps. In Lesson 25, Deitel shows how to create and test Windows Store apps and upload them to Microsofts Windows Store. • Databases and LINQ to Entities: The LINQ to SQL technology covered in the previous edition has been replaced with the more robust LINQ to Entities and the ADO.NET Entity Framework; • Microsofts free SQL Server Express 2012 is used to present the fundamentals of database programming; • ASP.NET 4.5, Microsofts .NET server-side technology, enables developers to create robust","link":"https://redhoop.com/udemy-c-2012-fundamentals-part-ii-4058-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"2","label":"SQL Server 2008 Essential Training","description":"Show Details Hide Details In SQL Server 2008 Essential Training, Simon Allardice explores all the major features of SQL Server 2008 R2, beginning with core concepts: installing, planning, and building a first database. Explore how Transact-SQL is used to retrieve, update, and insert information, and gain insight into how to effectively administer databases. The course also covers features outside SQL Server s database engine, including technologies that have grown up around it: SQL Server Reporting Services and Integration Services. Exercise files are included with the course. Topics include: Using T-SQL (Transact-SQL) Managing databases with SQL Server Management Studio Understanding database normalization Using SELECT statements Building indexes Monitoring database size and integrity Backing up and restoring databases Creating functions and stored procedures Managing database permissions Creating and formatting reports Adding charts to reports Creating and executing a simple SSIS pac","link":"https://redhoop.com/lynda-sql-server-2008-essential-training-1719-2.html","serviceName":"lynda.com"}]
