
[{"TOTALCOUNT":"3","label":"Design Thinking - Customer Journey Mapping","description":"Fellow Value Engineers,  &nbsp;  This is a good, short guide to what is customer journey mapping.&nbsp; This technique is understood by presales/solution engineers who have attended the Solution Revolution training course.  &nbsp;  Briefly - customer","link":"https://community.wdf.sap.corp/docs/DOC-129999","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Be inspired by Design Thinking! // E-Learning available (47 min)","description":"With the new E-Learning you get an overview of Design Thinking and hear from Jim and SAP employees, e.g. from Heike,&nbsp; what Design Thinking means for them.  &nbsp; You learn about the components of Design Thinking as well as the step-by-step approach","link":"https://community.wdf.sap.corp/docs/DOC-182415","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Internal OEM Design Doing in MEE - \"The Chained Tiger @ SAP\"","description":"As part of bringing the global OEM community up-to-speed on design thinking, we re using this opportunity to \"design do\" with exercises around account planning on strategic and key accounts.&nbsp; John Gibson and I had a great time working with our","link":"https://community.wdf.sap.corp/community/dtwithsap/blog/2013/06/22/internal-oem-design-doing-in-mee--the-chained-tiger-sap","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design Thinking Methodology Shining in ICR Customer Visit of Zoomlion and SITC","description":"Inter-Company Reconsolidation team had customer visit to Zoomlion on Mar. 26th for validation. Team members were Eva Wang(Product Owner), Nicole Li(User Experience Designer) and me Hua Ji( Quality Management &amp; Design Thinking Coach).  This was the","link":"https://community.wdf.sap.corp/groups/erp-fin-tech/blog/2013/03/29/design-thinking-methodology-shining-in-icr-customer-visit-of-zoomlion-and-sitc","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Providing Visibility to Sales Outcomes","description":"All, &nbsp;  Please note that the opportunity level flag in CRM, previously labled \"Solution Revolution\" has now been updated to \"Design Thinking With SAP\".&nbsp; Use of this flag is critical, as it provides visibilty to sales outcomes for our regional","link":"https://community.wdf.sap.corp/thread/120222","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"HANA and the Solution Revolution Support Each Other","description":"Summary: Our Initiatives around HANA and the Solution Revolution support each other strongly, so they should not be looked at as two separate things that have no connection.  Solution Revolution (and the Design Thinking that its based on) encourages","link":"https://community.wdf.sap.corp/docs/DOC-182229","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Customer Journey Mapping in Nestlé Account Planning Session","description":"Hi, &nbsp; &nbsp; I would like to share with you some insights about our DT inspired Account Planning my colleague Ghoutam Banerjee and I ran with the Core Account Team of one of our Global Top Accounts (Nestl&#233;).  &nbsp;  &nbsp; We had 1,5 days for","link":"https://community.wdf.sap.corp/community/dtwithsap/blog/2013/03/20/customer-journey-mapping-in-nestl%C3%A9-account-planning-session","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Mandatory Design Thinking - Solution Revolution Training for Industry Business Solutions (IBS)","description":"We want to build relevant solutions for our industries and LoBs, reach customers through all routes to market, scale our solutions effectively, and focus on the solutions that really move the needle. To that end, SAP is broadly adopting Design Thinking","link":"https://community.wdf.sap.corp/docs/DOC-173629","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design Thinking sparkling everywhere","description":"As a conviction, Design Thinking is more than DT workshop, customer journey map and fantastic concept demo, etc. It can be something applied to everywhere leading to wonderful results depending on how you deal with the process with innovative approach.","link":"https://community.wdf.sap.corp/thread/140020","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design Thinking coach/speaker needed for DKOM at Washington DC March 20","description":"Hi all, &nbsp;  I would like to have Design Thinking as a topic in our local DKOM at Washington DC. Our event will be on Wednesday March 20th.  So, I am looking for someone that could give us an introductory Design Thinking session, as budget is limited","link":"https://community.wdf.sap.corp/thread/124850","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Infusing Design Thinking into Account Planning - PCN Travel & Transport Summit 2013","description":"How did we infuse a Design Thinking mindset and approach into  the 2013 PCN Travel &amp; Transport Summit? &nbsp;   Where? SAP HQ, Walldorf, Germany&nbsp;&nbsp;&nbsp; When? 23-24 April 2013  What?&nbsp;  The Travel and Transport Summit was a two day","link":"https://community.wdf.sap.corp/docs/DOC-205046","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Idea Submission - Design Thinking","description":"How to use design thinking to visually explain the \"customer journey\" (from the origin of the need through evaluation of possibilities to the final decision). &nbsp; Idea focus on the paradigm shift: &#8220;from helping sales to sell to helping customers","link":"https://community.wdf.sap.corp/groups/innovation-days-emea/blog/2012/06/15/idea-submission--design-thinking","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"OneSAP Solution Revolution - Innovation Academy for Customers, featuring Roger Martin","description":"In November, 5th we held in Brazil the Innovation Academy event. This is a multi-customer event to promote how SAP can help customers to uncover high value initiatives using innovation and design thinking.  &nbsp;  We had 37 participants, from customers","link":"https://community.wdf.sap.corp/community/dtwithsap/blog/2012/12/23/onesap-solution-revolution--innovation-academy-for-customers-featuring-roger-martin","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design thinking workshop in Shenzhen for southern China Partner","description":"On April 19th, we hold an design thinking workshop in Shen Zhen, all of the participators are from SAP Partner. This is my first time to do the presentation, and I was in charge of the introducing and organizing the customer journey map.  I used","link":"https://community.wdf.sap.corp/docs/DOC-203457","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"2012 Design Thinking Customer Journey Map.pdf","link":"https://documents.wdf.sap.corp/share/page/site/sap-precision-marketing/document-details?nodeRef=workspace://SpacesStore/fda371c4-3d83-4758-b63a-658a2c1f91da","serviceName":"documents.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design Thinking Project with Tele-Board - Coach needed","description":"Hi Design Thinkers, &nbsp;  I am looking for a Design Thinking Coach for my thesis project for SAP next two weeks. &nbsp;  I studied psychology in Berlin and attended two semester the design thinking program from the d.school in Potsdam and I now work","link":"https://community.wdf.sap.corp/thread/136470","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Example of Customer Journey Map - Whirlpoool","description":"When completing an internal account planning session the AE and GAD specifically asked us to complete a customer journey map. Whirlpool has been an SAP customer for a while and we are trying to generate innovative ideas that we can showcase to them. The","link":"https://community.wdf.sap.corp/docs/DOC-162756","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Solution Revolution: Customer Journey Mapping","description":"UPDATED: Many of you have asked for a \"how to\" guide to Customer Journey Mapping.&nbsp;&nbsp;&nbsp; Check out the attached \"Journey Mapping Toolkit.ppt\" Meeta Patel has created that includes a script and introductory slides sharing one option to","link":"https://community.wdf.sap.corp/community/dtwithsap/blog/2011/12/13/solution-revolution-customer-journey-module-3","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"SR for Account Planning at Amerigas  Store of the Future","description":"Last week, the Solution Engineering team partnered with Value Engineering and Industry and hosted a Journey Mapping session for Amerigas.&nbsp; Under the tutelage of Rick Wenger, I co-facilitated my first SR workshop.&nbsp; We applied solution revolution","link":"https://community.wdf.sap.corp/thread/108433","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"2","label":"Design Thinking - Account Planning Session","description":"In the UK we are running a series of design thinking 4 account planning sessions as part of the design thinking accreditation. The first of these took place on Friday in the new design thinking with SAP room at Clockhouse Place. The session focused on a","link":"https://community.wdf.sap.corp/community/dtwithsap/blog/2013/07/08/design-thinking--account-planning-session","serviceName":"community.wdf.sap.corp"}]