
[{"TOTALCOUNT":"4","label":"The Next Convergence: Digital, Social Media, and Communities - Why It Matters to You","description":"The Convergence is Happening...  &#160; Social media and social networking have turned traditional business practices upside down. Channels such as Facebook, Twitter, YouTube, LinkedIn and Google+ let companies and their customers, partners, developers","link":"http://scn.sap.com/community/social-media/blog/2012/12/01/the-next-convergence-digital-social-media-and-communities--why-it-matters-to-you","serviceName":"scn.sap.com"},{"TOTALCOUNT":"4","label":"Become a Pinterest Expert","description":"Show Details Hide Details You may have heard some news about one of the hottest social networks called Pinterest. According to Compete.com, there are approximately 32.8 million unique visitors to Pinterest as of September 2013. This has made Pinterest the world No #5 Social Network beating out Instagram. Pinterest users spend 1.5 hours a month on Pinterest that s more than LinkedIn, Twitter, and Google+ combined. Undeniably, Pinterest has taken the social media world by storm where users visually share, curate, and discover new posting or known as ‘pinning’ images or videos to their own or other’s pinboards. However, Pinterest is quickly becoming the trailblazing social network for millions of people across the world. This is what you can achieve when you invest in this course: Build Your Brand Online Improve Your Sales Significantly Build a List of Loyal Customers Save Cost on Offline Advertising Techniques Conquer The New Wave Of Social Networking If you re new to social media, this ","link":"https://redhoop.com/udemy-become-a-pinterest-expert-745-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"Social Network Engagement","description":"Have you ever got \"caught up in the hype\". Well thats where you need to be in the hype, all the social networks will make your business move to victory. This course is designed to keep you engaged within a strong structure. We will teach you how to tweet when you while your sleeping or attending a meeting with out getting dirty looks. Google search can be your best friend or your worst enemy. In this course we will teach you how to get the most out of google through the masses. If social networks were a night club, Facebook would be the V.I.P, twitter would be the dance floor and pinterest would be the bar. In this course we will teach you how to work the entire club to your advantage. We also offer the opportunity to learn in a private one on one setting with out social networking guru. Get involved!","link":"https://redhoop.com/udemy-social-network-engagement-8221-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"The Social Media Survival Guide","description":"Show Details Hide Details This social media course is based on the book, The Social Media Survival Guide, which is used in colleges and universities worldwide. It is taught by the book s author and social media professor, Deltina Hay. In this extensive course, you will learn how to prepare your social media plan, and how to apply effective tactics and optimization techniques to many social media tools. The course emphasizes creating an optimized social media strategy that will help you achieve long-term placement and maximum exposure for you and your business in the social web. Topics covered in this class include: ●  RSS Feeds ●  Blogging with WordPress ●  Using WordPress to power your website ●  Social networking sites: Facebook, LinkedIn, and Google Plus ●  Twitter and Mobile Technologies ●  Social bookmarking and crowd-sourcing sites ●  Media sharing sites: Flickr, YouTube, Slideshare, and Pinterest ●  Implementing social media widgets ●  Integrating your social media presence ●  S","link":"https://redhoop.com/udemy-the-social-media-survival-guide-638-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"Social Networks to watch in 2013","description":"Social networking is how we stay connected with our friends and families. Most of us have have Facebook, Instagrams, Pinterest, Twitter, or Linkedin. CNN listed 7 social networks to look out for in 2013. Personally, I know I am looking forward to","link":"https://community.wdf.sap.corp/community/marketing/blog/2013/01/10/social-networks-to-watch-in-2013","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"4","label":"Facebook Page Essentials","description":"Show Details Hide Details Facebook Profiles are for People | Facebook PAGES are for BUSINESS Facebook is still the most popular social networking site out there, with over one billion registered users. And research shows that over 40% of Facebook users actually want to connect with businesses on Facebook. But to reach this audience, you need to meet them on their turf - and creating a Facebook Page for your business or organization is the way to do that. A Facebook Business Page can help you reach and connect with your target audience within the Facebook platform. This condensed and comprehensive course will get you up and running using Facebook Pages to their full potential in no time. Business owners, entrepreneurs, marketers, social media strategists, non-profits, artists, musicians, authors, and advertising professionals will all benefit from taking this course. Follow author, developer, and new media pioneer, Deltina Hay, as she walks you through the process of setting up and deve","link":"https://redhoop.com/udemy-facebook-page-essentials-8646-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"Social Media for Business Growth","description":"Today’s customers are online, web savvy and socially connected. Which means they’re better informed, harder to reach and harder to please. It’s clear then, that the world of business has changed. But have you kept up? Do you have the tactics, tools and training to leverage social media for business success? Social Media Marketing gives you a powerful mix of rich customer data, flexible marketing platforms and the chance to get ahead of your competitors. This new and highly practical Social Media for Business Growth will give you actionable tips and ideas so that you make the most of: ·  Twitter ·  LinkedIn ·  Facebook ·  Blogging and more…","link":"https://redhoop.com/udemy-social-media-for-business-growth-8175-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"G+ Social Power: Getting Started & Set-Up On Google+","description":"Show Details Hide Details Many of my students, individuals and businesses have asked me about Google+. Why should they be on it? How can I get started? I am on Google+ now what? Well, I have all the answers and more for you in this brand new course called: G+ Social Power: Getting Started & Set-Up On Google+. This comprehensive course walks you from beginning to end so that you too can understand how to use Google+. Why is Google+ Important? Google+ is the second largest social media networking site in the world. Google+ has 359 million monthly active users A referral from Google+ is worth an average of $10.78, compared to Facebook at $2.35 and Twitter at $1.62. Google+ users spend 6 minutes and 20 seconds on average compared to Facebook users who spend 3 minutes and 53 seconds. Access to 6 Modules (20 Videos) Module 1: Overview of the Google+ Platform Module 2: Getting Started on Google+ Module 3: Google+ Page Management and Awareness Building Module 4: Google+ Pages and Tools","link":"https://redhoop.com/udemy-g-social-power-getting-started-set-up-on-google-9983-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"4","label":"Introduction To Social Media In Education","description":"Show Details Hide Details Social media has revolutionized communication, business and even the way we interact day to day. This detailed course will show you how social networks can be used to innovate the classroom and broaden your own professional skill-set and personal learning network. Leigh Technology Academy ICT teacher and social media addict Toby Adams presents this comprehensive and fun introduction to social media in education. With tutorials taking you through the four major social networks (Twitter, Facebook, Google+, Pinterest), the course provides everything you need to get up to speed in social media as well as create, build and grow your personal learning network. What is covered in this course? Twitter Facebook Google+ Pinterest What will you master on successful completion of this course? Choosing the right social network for you and your school Understanding the key differences and benefits between different social networks Ensuring privacy and security settings are ","link":"https://redhoop.com/udemy-introduction-to-social-media-in-education-4789-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"3","label":"World Map of Social Networks","description":"Facebook with more than 800 million active users has established its leadership position in 127 out of 136 countries analyzed (in this edition I&#8217;ve added Afghanistan). Since June 2011 the largest social networking service of the world has finally","link":"https://community.wdf.sap.corp/groups/mobile-applications-for-retail/blog/2012/01/30/world-map-of-social-networks","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Twitter Success for your Business","description":"Show Details Hide Details Twitter Success for your Business is the only video you ll ever need, to get you going on one of the world s largest social networks. It is everything you need to know about Twitter to help you engage with your target customers, extend your business network, drive more traffic to your website, increase revenue and much more. Once you ve learnt the basics, we ll show you how to use Twitter in a way that will prevent it from taking over your life, introduce you to some clever search techniques, send engaging tweets that will encourage interaction from your customers, market your company to over half a billion Twitter members, share information and ideas about your products and services, build customer relations, create bigger brand awareness globally and measure your social media success along the way. This course is suitable for anybody whether they re yet to join Twitter, a relatively new user or have been active on the network for some time. Whatever stage yo","link":"https://redhoop.com/udemy-twitter-success-for-your-business-4391-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"3","label":"A Tale of Two Social Networks (Part 1)","description":"I had the opportunity recently to spend time with a number of our customers and the EMEA MDs of both Twitter and Facebook. The topic was Social Commerce and the goal was for the two big Social Networks to explain how their platforms could help","link":"https://community.wdf.sap.corp/community/marketing/blog/2012/06/14/a-tale-of-two-social-networks-part-1","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Blogging for Your Business","description":"Show Details Hide Details Blogging for Your Business takes you through the planning process of creating a blog as part of your business marketing strategy. Author Morten Rand-Hendriksen provides a structured approach that divides the planning process into discrete stages, each with its own tasks and decisions. Through the course you are presented with key decisions, best practices, and expert advice that make you better informed and more equipped to build a blog that helps boost your business and its presence online. The course also shows how to set goals, delegate responsibilities, find a content niche, recruit contributors, and how to make technology decisions. Topics include: Why blog for business? Defining goals for your blog Deciding where to host a blog Picking a platform Creating a content strategy Designing the blog Scheduling posts Promoting posts on Facebook, Twitter, and other social networks","link":"https://redhoop.com/lynda-blogging-for-your-business-5219-2.html","serviceName":"lynda.com"},{"TOTALCOUNT":"3","label":"4 Powerful Social Media Shortcuts that will Surprise You!","description":"SAP CIO Oliver Bussmann, recognized as the #1 Social CIO, is distinguished as a thought leader and influencer in the Enterprise IT industry. Oliver actively engages on Twitter, blogs, and other social networks daily addressing the latest trends in data,","link":"https://community.wdf.sap.corp/community/global_it/blog/2013/02/13/oliver-bussmann-s-2013-social-media-tips","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Join and Contribute to Social Media!","description":"Hi All,  The  Social Media Revolution  has outsmarted all the traditional methods of Marketing.  To catch up with the growing trends, we are expanding the Social Media reach for SAP Value Management Team.  Request you all to follow the  Twitter handle ","link":"https://community.wdf.sap.corp/thread/135658","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Understanding Hashtags in Social Media","description":"Why Take This Course? Hashtags help group together conversations taking place on social networks. Everybody is using them to insert their thoughts, comments or strategies into social media conversations. Each social network has its own unique way to use hashtags. Many people use these in the incorrect manner and wonder why their post doesn t have the reach they were hoping for. This course is going to put an end to that. What Should I Expect? You should expect to have a better understanding of hashtags and know how to use them in the proper manner. You should also be able to differentiate between the different social networks and know the difference in how each network uses hashtags. Thanks for checking out my course. Please subscribe and make sure to share it with that friend that you know could use some more hashtag knowledge in their life.","link":"https://redhoop.com/udemy-understanding-hashtags-in-social-media-9273-2.html","serviceName":"udemy.com"},{"TOTALCOUNT":"3","label":"Social Media Marketing","description":"This special 1-day intensive is for photographers wanting a step-by-step guide to growing their business through social media. Learn how to build your reputation online, find new clients, and network with colleagues. Lindsay Adler, author of The Linked Photographers  Guide to Online Marketing and Social Media, covers many social media platforms including the essentials: Twitter, Facebook, Flickr, and YouTube. Topics such as blogging and SEO are covered, providing photographers a guide to best practices in order to make the most out of their online efforts. Twitter Giveaway! During this class listen for great tips or quotes, and post them on Twitter with the short URL below. We ll pick our favorites for the Twitter giveaway during this workshop. Lindsay Adler quote: Twitter Contest - Official Rules","link":"https://redhoop.com/creativelive-social-media-marketing-6210-2.html","serviceName":"creativelive.com"},{"TOTALCOUNT":"3","label":"comScore 2010 Digital Review Research - Europe","description":"This isn t B2B specific but there are some interesting developments in social media in Europe shown in this report.&nbsp; Highlights: &nbsp; &nbsp; Europe Shows the Highest Growth in Social Networking Reach across Regions - 10.9% increase    Russian","link":"https://community.wdf.sap.corp/docs/DOC-43710","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Join and Contribute to Social Media!","description":"Hi All,  The  Social Media Revolution  has outsmarted all the traditional methods of Marketing.  To catch up with the growing trends, we are expanding the Social Media reach for SAP Value Management Team.  Request you all to follow the  Twitter handle ","link":"https://community.wdf.sap.corp/thread/135798","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"3","label":"Social Media Monitoring with Google Reader","description":"Show Details Hide Details Social media monitoring online conversations is the first step to an effective social media management. Learn to listen online in our NEW social media training course at social media monitoring. You can t build a smart social media strategy if you don t know where your customers are. Learn how to use social monitoring tools to find the hot pockets of conversation and meet you customers on their own turf. Master the art and science of social media monitoring and strike where the iron is hot! Learn social media monitoring for Facebook, Twitter, Linkedin, YouTube, Craigslist, Blogs, Forums and News using free social media monitoring tools and services. Learn to use social media tools to conduct content curation and find online influencers. You ll even see a live demonstration of Radian6 and hear how the instructor used this premium service to calculate the ROI of Obama s Cairo speech. Get this online social media monitoring course today and start engaging your cu","link":"https://redhoop.com/udemy-social-media-monitoring-with-google-reader-583-2.html","serviceName":"udemy.com"}]