
[{"TOTALCOUNT":"4","com.sap.ais.tax.core.uri":"learningcourse5B8D034D6B90C46AF00463441A7B69054D522090","label":"Pinterest POWER! Discover this HOT social network.","description":"This Pinterest Tutorial course aims to demystify Pinterest and all of its features.  Pinterest has become one of the MOST POWERFUL social platforms on the internet today.  Utilizing it in the right way will allow people and businesses to create an interested following in a SHORT amount of time.  At the beginning, the basic features are covered including how to set up a new account on the network followed by a FULL WALK-THROUGH showing more advanced features such as CREATING A BOARD, HOW TO PIN, and WHY FOLLOWING IS IMPORTANT.  At the end of this Pinterest Tutorial course, each learner will have the confidence, ability and knowledge to take their PINTEREST accounts and create the sort of network and INFLUENTIAL following they desire. Take this Pinterest Tutorial course and discover how to leverage this HOT Social Network!</p>","link":"https://redhoop.com/udemy-pinterest-power-discover-this-hot-social-network-796-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"3","com.sap.ais.tax.core.uri":"learningcourse2DDA6A9CD9D8C4382833C9EA9A06EAC21B1D8595","label":"How to Create a Social Network Site from Scratch","description":"Show Details Hide Details With \"How to Create s Social Network Site From Scratch\", you will learn everything you need to create a social network site. This course it s structured in 6 chapters, more than 30 video lectures. The entire course it s based on an social network site example, inspired mainly on pinterest like site, that you ll learn to create from zero. I m a real fan of the learn-by-project method because it forces you to learn all the concepts applying them with something that you can use and re-use at the end. Why learn to create a social network site? The full course has more than 30 video lectures, divided into 6 chapters. Each chapter will give you a new level of knowledge in developing a social network site. We ll start from the basics with XHTML, CSS and Javascript to more advanced and the most popular/requested programming languages nowadays, such as ASP.NET 4.0, jSON, AJAX, jQuery, OOP, WebServices, the MS SQLServer database and the new HTML5+CSS3! The source code o","link":"https://redhoop.com/udemy-how-to-create-a-social-network-site-from-scratch-8779-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"learningcourseF41F24617A81E879F5BFF4C93050944629920831","label":"SharePoint 2010 Social Networking for End Users","description":"In this course you will learn about some of SharePoint 2010 s social capabilities. SharePoint 2010 includes a site template for blogs where users and teams can easily publish simple content for others to read and comment on. It also includes a wiki site template which allows users to jointly collaborate on content such as in the case of a knowledge base. In this course you ll learn not only how to create both blogs and wikis in SharePoint 2010, but you ll also learn how to manage and use them effectively.","link":"https://redhoop.com/pluralsight-sharepoint-2010-social-networking-for-end-users-7046-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"pluralsight.com"},{"TOTALCOUNT":"2","com.sap.ais.tax.core.uri":"learningcourse8E6BF3D6EC5950D643FC0034B33D1658E29D745D","label":"Social Network Engagement","description":"Have you ever got \"caught up in the hype\". Well thats where you need to be in the hype, all the social networks will make your business move to victory. This course is designed to keep you engaged within a strong structure. We will teach you how to tweet when you while your sleeping or attending a meeting with out getting dirty looks. Google search can be your best friend or your worst enemy. In this course we will teach you how to get the most out of google through the masses. If social networks were a night club, Facebook would be the V.I.P, twitter would be the dance floor and pinterest would be the bar. In this course we will teach you how to work the entire club to your advantage. We also offer the opportunity to learn in a private one on one setting with out social networking guru. Get involved!","link":"https://redhoop.com/udemy-social-network-engagement-8221-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"udemy.com"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content2DE90FB074C8ECA0637710758B4088F293A5E3DC","label":"Get in the Game with SCN! The Social Network for SAP Professionals Introduces Game Mechanics","description":"What is SCN? As you may or may not know, the SAP Community Network is one of the largest online community of SAP professionals. Every month, an average of 2 million customers, partners and employees visit SCN to learn, trouble shoot, share knowledge and","link":"https://community.wdf.sap.corp/community/marketing/blog/2013/05/03/get-in-the-game-with-scn-the-social-network-for-sap-professionals-introduces-game-mechanics","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content45993D8C675EA08E2620DBE5A8EB4FB3BF0B2AA7","label":"Care Circles: Using Mobile Social Networks to Reduce Cost, Engage Patients, and Improve Healthcare Outcomes","description":"Reason for project  Caring for family members with serious health issues, chronic conditions, or mental illnesses can be stressful, time-consuming, and emotionally draining.&nbsp; Caregivers need to learn about the condition, create a plan of action, and","link":"https://community.wdf.sap.corp/docs/DOC-190725","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"learningcourse60339FEF4E73235AB5EF81E8D69F7C2B5AF3E313","label":"Social Network Analysis","description":"Everything is connected: people, information, events and places, all the more so with the advent of online social media. A practical way of making sense of the tangle of connections is to analyze them as networks. In this course you will learn about the structure and evolution of networks, drawing on knowledge from disciplines as diverse as sociology, mathematics, computer science, economics, and physics. Online interactive demonstrations and hands-on analysis of real-world data sets will focus on a range of tasks: from identifying important nodes in the network, to detecting communities, to tracing information diffusion and opinion formation.","link":"https://redhoop.com/coursera-social-network-analysis-3756-2.html","com.sap.ais.tax.core.type":"learningcourse","serviceName":"coursera.org"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content59840263AEA1CF35242EAB478A74CF8145494CE5","label":"Would like understand more about netweaver and social networks","description":"Hi Guys, &nbsp;  I would love to know more about how Netweaver works with social networks. I am quite knowledgable in social networks but not very techie. Is there an idiots guide somewhere? Or how to use netweaver with social networks for dummies?","link":"https://community.wdf.sap.corp/thread/102577","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentF176585467E6001A58A15161F274459E9AA29115","label":"Social Media live webinar #2... the How to Guide \"Social Networking with Business Focus: LinkedIn and Xing\"","description":"This how to guide was created to &#8220;Webinar Overview&rdquo; as the content within the guide is specific  only to the content in the Social Media live webinar #2.","link":"https://community.wdf.sap.corp/docs/DOC-21767","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentDA4D822004AE703D449E05EF91F2679BE7248AD9","label":"ORACLES use of Social networks in Fusion (at least they use it for PR)","description":"Global CIO: Oracle s New Fusion Apps: An Inside Look InformationWeek.com, USA / Internet - September 22, 2010 Information Week offers an advance look at some of the features and product strategies behind Oracle s Fusion Apps, introduced by Larry Ellicon","link":"https://community.wdf.sap.corp/docs/DOC-20165","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentBD040EFE69CC8C90EE72A82D7BCB7B9FF06A781","label":"Web 2.0 - The potential of social networks","description":"Introduction I had a discussion with a fellow colleague of mine the other day that got me thinking about the non-technical aspect of Web 2.0. While it may be surprising for some of you to hear - I find the social aspect of the Web 2.0 movement much more","link":"http://scn.sap.com/community/social-media/blog/2010/04/29/web-20--the-potential-of-social-networks","com.sap.ais.tax.core.type":"content","serviceName":"scn.sap.com"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"contentFF49B4B55B7BC66FDA9672E6998497C0C489D7A0","label":"May Idea Shortlisted - Extend Reach: SAP Virtual Retail Market Place - Our Apps in Social Networks","description":"What is your innovative idea? Tell us about the exchanges and thoughts from your session? &nbsp; At SAP Applications in Social Networks workshop we did a brainstorming, where we were looking for ideas how SAP application and online social networks could","link":"https://community.wdf.sap.corp/docs/DOC-60680","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content1BBE0B2B4423849625E9F7520ED03572CF6965C2","label":"Should we trust social networks in business?","description":"Here is a quick synopsis of the industry workshop I attended last week in Munich: &nbsp; Participants came from Siemens, IBM, HP, Capgemini, SAP plus a couple of smaller firms and agencies. We discussed the changing role of influencer relations in our","link":"https://community.wdf.sap.corp/thread/23399","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"content647A73927005FC24A97E428260A3FF31D3FAA383","label":"Value Engineering based BASHO 2.0 Training incl Social Network selling material","description":"The Game is on and your Sales University team is fully dedicated to your success!  With the Value Engineering BASHO 2.0 &amp; Social Network Selling workshop,&nbsp; the SAP Sales University team and NNN Business Development offer a development","link":"https://community.wdf.sap.corp/docs/DOC-116585","com.sap.ais.tax.core.type":"content","serviceName":"community.wdf.sap.corp"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"groupE3BAC9C66B5F0812D19965B297CE933C3E4CF2C4","label":"Social Media and Social Networks","description":"SCN social media space where community members can share their experience and knowledge on this topic. Read insightful blog posts about trends and changes that affect the way people discover, follow and engage with content, people and organizations through social media. Tips and best practices for u","link":"http://scn.sap.com/community/social-media","com.sap.ais.tax.core.type":"group","serviceName":"scn.sap.com"},{"TOTALCOUNT":"1","com.sap.ais.tax.core.uri":"termF8E72DF1FC23C7778C2582953870BE876E103812","label":"Social Networking Best Practices","description":"Best Practices refers to one or more sets of refined policies, procedures, processes, techniques, tools and methodologies that have been optimized for efficiency and effectiveness, and adopted within the organization.","com.sap.ais.tax.core.type":"term","serviceName":"skillsplex"}]